verification/runs/T-family/T3_runs/R_f/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

scale 1;
vertices
(
    (-1.8240000000 0.0380000000 0.0000000000)
    (0.0000000000 0.0380000000 0.0000000000)
    (0.0000000000 0.1900000000 0.0000000000)
    (-1.8240000000 0.1900000000 0.0000000000)
    (0.0000000000 0.0000000000 0.0000000000)
    (1.1400000000 0.0000000000 0.0000000000)
    (1.1400000000 0.0380000000 0.0000000000)
    (1.1400000000 0.1900000000 0.0000000000)
    (-1.8240000000 0.0380000000 0.0038000000)
    (0.0000000000 0.0380000000 0.0038000000)
    (0.0000000000 0.1900000000 0.0038000000)
    (-1.8240000000 0.1900000000 0.0038000000)
    (0.0000000000 0.0000000000 0.0038000000)
    (1.1400000000 0.0000000000 0.0038000000)
    (1.1400000000 0.0380000000 0.0038000000)
    (1.1400000000 0.1900000000 0.0038000000)
);
blocks
(
    // B1 upstream: x from inlet to step, fine x cell touches x = 0 (ratio < 1)
    hex (0 1 2 3 8 9 10 11) (256 204 1)
    simpleGrading ( 0.0512120801451 ( (0.5 0.5 73.1563775576) (0.5 0.5 0.0136693482289) ) 1 )
    // B2 lower downstream: y from heated wall (0) to step top (H)
    hex (4 5 6 1 12 13 14 9) (512 154 1)
    simpleGrading ( 3.37550414439 ( (0.5 0.5 16.7575737925) (0.5 0.5 0.0596745097104) ) 1 )
    // B3 upper downstream: y from H to 5H, identical y grading to B1
    hex (1 6 7 2 9 14 15 10) (512 204 1)
    simpleGrading ( 3.37550414439 ( (0.5 0.5 73.1563775576) (0.5 0.5 0.0136693482289) ) 1 )
);
edges ();
boundary
(
    inlet        { type patch; faces ( (0 3 11 8) ); }
    outlet       { type patch; faces ( (5 6 14 13) (6 7 15 14) ); }
    upstreamWall { type wall;  faces ( (0 1 9 8) ); }
    stepWall     { type wall;  faces ( (4 1 9 12) ); }
    heatedWall   { type wall;  faces ( (4 5 13 12) ); }
    topWall      { type wall;  faces ( (3 2 10 11) (2 7 15 10) ); }
    frontAndBack { type empty;
                   faces ( (0 1 2 3) (8 9 10 11)
                           (4 5 6 1) (12 13 14 9)
                           (1 6 7 2) (9 14 15 10) ); }
);
mergePatchPairs ();
